Luminos-Tech/luminostech-lumohub/Lumo/Lumo-Band/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# ESP32-C3 band: BLE peripheral broadcasts samples to the S3 hub.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# ESP32-C3 SuperMini tren COM6 co 4 MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ESP32-C3 SuperMini native USB console.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
